snlkuharlocal/src/DataProcessors/ПроверкаРеквизитовСправочников/ПроверкаРеквизитовСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаРеквизитовСправочников</name>
  <comment>ПроверкаРеквизитовСправочников</comment>
  <attributes>
    <name>HTTPОбменАдресСкрипта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автообмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПрайсЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияСОтмененнымиЗаказами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНовойНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьДокументыТекущейДатой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассифицироватьПоЦеновымГруппам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСсылка</name>
    <type>
      <types>CatalogRef.НастройкиОбменаССайтом</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоАдресаСкрипта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗаказами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменТоварами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительЗапроса</name>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытияЗаказов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокументыОперативно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяТаблицаКаталогов</name>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителя</name>
  </attributes>
  <attributes>
    <name>СпособИдентификацииКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбменаЗаказами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбменаТоварами</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтомТоварами</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВремени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКоличества</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСуммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделительДатаВремя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЦветаИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбменаКонтрагентами</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтом_b2b</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКонтрагентами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/УниверсальныеРазмеры/УниверсальныеРазмеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УниверсальныеРазмеры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ФР_РазмерныеРяды</owners>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длинна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерРоссийский</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерЕвропейский</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКазахский</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметр1</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметр2</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметр3</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УниверсальныеРазмеры</name>
    <attributes>
      <name>УниверсальныйРазмер</name>
      <type>
        <types>CatalogRef.УниверсальныеРазмеры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Цвета/Цвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Цвета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>РусскоеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Многоцветный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЦвет</name>
    <type>
      <types>CatalogRef.Палитра</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЦветНеОбязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЧЗ</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Палитра</name>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПроверкаРеквизитовСправочников/ObjectModule.bsl
Перем КритичОшибки Экспорт;

Перем мМассивЗагруженныхДокументов;

Перем мКаталогНаДиске;
Перем мПодкаталогФайлов;
Перем мПодкаталогБезопасностиКаталогаВыгрузки;

Перем НастройкаОбмена;
Перем Рубли;

Перем мКаталогВременныхФайлов;

Перем ТЗФайловИМ, МассивЗнИм, крОшибки;


Процедура СообщитьКритОшибки(ПутьФайла) Экспорт
	
	Если  крошибки.количество()=0 тогда
		возврат;
	КонецЕсли;
	
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("krohin@collant.ru"); //+++
	////
	////крохин начало 28.03.2023
	СообщениеКрит.Получатели.Добавить("chelnokova@collant.ru");//
	////крохин конец 28.03.2023
	
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	сообщениеКрит.Отправитель="helpdesk@collant.ru";
	СообщениеКрит.Тема="Проверка заполнения справочников.Ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	СообщениеКрит.Тексты.Добавить("Есть ошибки заполнения!");
	
	//Если  крошибки.Количество()>0 Тогда
	//	Для рр=0 по крошибки.Количество()-1 Цикл
	//		Строка=Строка+Символ(13)+НомСтр+". "+крошибки[рр];
	//		//Строка=Строка+Символ(13);
	//		НомСтр=НомСтр+1;
	//	КонецЦикла;
	//КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	//СообщениеКрит.Тексты.Добавить(Строка);
	
	СообщениеКрит.Вложения.Добавить(ПутьФайла);
		
	Попытка
		Почта= Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	Исключение
	КонецПопытки;
	
КонецПроцедуры



Процедура ОтобразитьСостояние(ТекстСообщения)
	#Если Клиент Тогда
		Состояние(ТекстСообщения);
	#Иначе
		//ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация"); 	
	#КонецЕсли	
КонецПроцедуры

Процедура ДобавитьТекстКСообщениюДляПользователя(ТекущееСообщение, ДобавляемоеСообщение)
	
	ТекущееСообщение = СокрЛП(ТекущееСообщение + Символы.ПС + ДобавляемоеСообщение);	
	
КонецПроцедуры

Процедура СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке = "", Статус = Неопределено)
	
	#Если Клиент Тогда
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Обычное;	
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#Иначе
		ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация");                     
	#КонецЕсли
	
КонецПроцедуры	

// Процедура выводит текст ответа сервера, если в нем имеется
// расширенное описание ошибки (строки, начиная со 2-й)
//
// Параметры:
//  ОтветСервера - строка, текст ответа сервера
//
Процедура СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера)
	
	ТекстСообщения = "Ответ сервера:" + Символы.ПС;
	
	Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
		Для ТекСтрока = 2 по СтрЧислоСтрок(ОтветСервера) Цикл
			ТекстСообщения = ТекстСообщения + СтрПолучитьСтроку(ОтветСервера, ТекСтрока) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СообщитьПользователю(ТекстСообщения, Истина, СтатусСообщения.Информация);	
	
КонецПроцедуры	


//// Процедура выводит текст сообщения об ошибке обмена
//// и текст "Обмен не выполнен."
////
//// Параметры:
////  ТекстСообщения - строка, текст сообщения
////
Процедура СообщитьОбОшибкеОбмена(ТекстСообщения, ИнформацияОВыгрузке)
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Обмен не выполнен";
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

//// Процедура выводит текст сообщения об исключительной ошибке
////
//// Параметры:
////
Процедура СообщитьОбИсключительнойОшибке(ИнформацияОВыгрузке, ТекстНачалаСообщения =  "", ТекстОкончанияСообщения = "")
	
	
	РасширеннаяИнформацияОбОшибке = ИнформацияОбОшибке();
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(ТекстНачалаСообщения) Тогда
		ТекстСообщения = ТекстНачалаСообщения + Символы.ПС;
	КонецЕсли;	
	ТекстСообщения = ТекстСообщения
	+ "Произошла ошибка: "
	+ РасширеннаяИнформацияОбОшибке.Описание;
	
	Если НЕ Строка(РасширеннаяИнформацияОбОшибке.Причина) = "ИнформацияОбОшибке" Тогда
		ТекстСообщения = ТекстСообщения
		+ ". По причине: "
		+ РасширеннаяИнформацияОбОшибке.Причина;
	КонецЕсли;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОкончанияСообщения;
	
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

////   ---------------------------------------------------------------------------------
Процедура ПроверитьДанные()

//1.	Номенклатура
//2.	«ЭтоМодель = Истина» + («ВыгружатьНаСтильпарк» = истина ИЛИ «Выгружать на B2b»= Истина»)  И (БрендФР.Пустая() ИЛИ «КоллекцияФР.Пустая()» ИЛИ «ВидНоменклатурыФР.Пустая()»
//3.	Этогруппа = Истина
//4.	Код, Наименование, ВыгружатьНаСтильпарк, Выгружать на B2b, БрендФР, КоллекцияФР, ВидНоменклатурыФР
//5.	krohin@collant.ru

	Запрос = Новый Запрос;
	
	СписокПолучателей = Новый СписокЗначений;
	СписокПолучателей.Добавить("krohin@collant.ru");
	СписокПолучателей.Добавить("chelnokova@collant.ru");
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель.Код КАК Код,
	|	Номенклатура.Родитель.Наименование КАК Наименование,
	|	Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк КАК ВыгружатьНаСайтСтильПарк,
	|	Номенклатура.Родитель.ВыгружатьВИнтернетМагазин КАК ВыгружатьВИнтернетМагазин,
	|	Номенклатура.Родитель.ФР_Бренд КАК ФР_Бренд,
	|	Номенклатура.Родитель.ФР_ВидНоменклатуры КАК ФР_ВидНоменклатуры,
	|	Номенклатура.Родитель.ФР_Коллекция КАК ФР_Коллекция
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И (Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ИЛИ Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да))
	|	И (Номенклатура.Родитель.ФР_ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ФР_ВидыНоменклатуры.ПустаяСсылка)
	|			ИЛИ Номенклатура.Родитель.ФР_Бренд = ЗНАЧЕНИЕ(Справочник.ФР_Бренды.ПустаяСсылка)
	|			ИЛИ Номенклатура.Родитель.ФР_Коллекция = ЗНАЧЕНИЕ(Справочник.ФР_Коллекции.ПустаяСсылка))";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	// ном	 код	 наименование	ВыгружатьНаб2б	ВыгружатьНаСтильпарк	ВидНом	Бренд	Коллекция
	путьфайла = "";
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ТабДок= Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывод = ИспользованиеВывода.Разрешить;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьЗаголовок);

	НомПП=1;
	
	
	Пока рез.Следующий() цикл
		
		КрОшибки.Добавить(""+Рез.код+" "+рез.наименование+" ВыгружатьНаСайтСтильПарк -"+рез.ВыгружатьНаСайтСтильПарк+", Выгружать б2б " +рез.ВыгружатьВИнтернетМагазин
		+", ФР_ВидНоменклатуры- "+рез.ФР_ВидНоменклатуры +", ФР_Бренд- "+рез.ФР_Бренд +", ФР_коллекция- "+рез.ФР_коллекция  );
		ОбластьСтрока.Параметры.код=Рез.код;
		ОбластьСтрока.Параметры.наименование=рез.наименование;
		ОбластьСтрока.Параметры.ВыгружатьНаб2б=рез.ВыгружатьВИнтернетМагазин;
		ОбластьСтрока.Параметры.ВыгружатьНаСтильпарк=рез.ВыгружатьНаСайтСтильПарк;
		ОбластьСтрока.Параметры.ВидНом=рез.ФР_ВидНоменклатуры;
		ОбластьСтрока.Параметры.Бренд=рез.ФР_Бренд;
		ОбластьСтрока.Параметры.Коллекция=рез.ФР_коллекция;
		
		
		ОбластьСтрока.Параметры.Ном=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
			
				
	конецЦикла;	

	ТабДок.ОтображатьСетку=Ложь;
	
	// нечаева 04,12,19++ поменяла формат
			
	Имя = Константы.КаталогЕКОД.Получить() + "Заполнение номенклатуры.xls";     //++++
	
	Попытка
		ТабДок.Записать(Имя,"xls");
	Исключение
		СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	// нечаева 04,12,19---
	
	// Шворобей ВЮ 10.04.2024 ++
	Если крОшибки.Количество() > 0 Тогда
	//	СообщитьКритОшибки(Имя);
		СформироватьВнутреннееУведомление(СписокПолучателей, "Заполнение номенклатуры", "Заполнение номенклатуры",
			,, Имя, "helpdesk@collant.ru");
	КонецЕсли;
	// Шворобей ВЮ 10.04.2024 ++

	///////////////////////////////////////////////////////////////////////////////////////////////////
	// проверка по размерам 
	//нечаева 12,01,24 +++
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка.Родитель КАК модель,
	|	Номенклатура.Ссылка.Родитель.Код КАК Код,
	|	Номенклатура.Ссылка.Родитель.Наименование КАК наименование,
	|	Номенклатура.Размер.Родитель КАК товарРазмерныйРяд,
	|	Номенклатура.Ссылка.Родитель.РазмерныйРяд КАК модельРазмерныйРяд,
	|	ВЫБОР
	|		КОГДА Номенклатура.Размер.Родитель <> Номенклатура.Родитель.РазмерныйРяд
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК сравнение,
	|	Номенклатура.Ссылка.Родитель.ВыгружатьВИнтернетМагазин КАК ВыгружатьВИнтернетМагазин,
	|	Номенклатура.Ссылка.Родитель.ВыгружатьНаСайтСтильПарк КАК ВыгружатьНаСайтСтильПарк
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА Номенклатура.Размер.Родитель <> Номенклатура.Родитель.РазмерныйРяд
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ = 1
	|	И (Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ИЛИ Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да))
	|
	|УПОРЯДОЧИТЬ ПО
	|	модель";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	// ном	 код	 наименование	ВыгружатьНаб2б	ВыгружатьНаСтильпарк	ВидНом	Бренд	Коллекция
	путьфайла = "";
	
	Макет = ЭтотОбъект.ПолучитьМакет("МакетРазницаРазмерныхРядов");
	
	ТабДок= Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывод = ИспользованиеВывода.Разрешить;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
	
	ТабДок.Вывести(ОбластьЗаголовок);

	НомПП=1;
	КрОшибки.очистить();
	
	Пока рез.Следующий() цикл
		
		КрОшибки.Добавить(""+Рез.код+" "+рез.наименование+" ВыгружатьНаСайтСтильПарк -"+рез.ВыгружатьНаСайтСтильПарк+", Выгружать б2б " +рез.ВыгружатьВИнтернетМагазин
		+", товарРазмерныйРяд- "+рез.товарРазмерныйРяд+", МодельРазмерныйРяд- "+рез.МодельРазмерныйРяд  );
		ОбластьСтрока.Параметры.код=Рез.код;
		ОбластьСтрока.Параметры.наименование=рез.наименование;
		ОбластьСтрока.Параметры.ВыгружатьНаб2б=рез.ВыгружатьВИнтернетМагазин;
		ОбластьСтрока.Параметры.ВыгружатьНаСтильпарк=рез.ВыгружатьНаСайтСтильПарк;
		ОбластьСтрока.Параметры.товарРазмерныйРяд=рез.товарРазмерныйРяд;
		ОбластьСтрока.Параметры.МодельРазмерныйРяд=рез.МодельРазмерныйРяд;
		
		
		ОбластьСтрока.Параметры.Ном=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
		//таб
			
				
	конецЦикла;	

	ТабДок.ОтображатьСетку=Ложь;
	
	
	//вторая таблица
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка.Родитель КАК модель,
	               |	Номенклатура.Размер.Родитель КАК товарРазмерныйРяд,
	               |	1 КАК колвоРазРядов
	               |ПОМЕСТИТЬ РазРяды
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.ЭтоГруппа = ЛОЖЬ
	               |	И (Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |			ИЛИ Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РазРяды.модель КАК модель,
	               |	ВЫБОР
	               |		КОГДА СУММА(РазРяды.колвоРазРядов) > 1
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК колвоРазРядов
	               |ПОМЕСТИТЬ РазРяды2
	               |ИЗ
	               |	РазРяды КАК РазРяды
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РазРяды.модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РазРяды2.модель КАК модель,
	               |	РазРяды2.колвоРазРядов КАК колвоРазРядов,
	               |	РазРяды2.модель.Код КАК Код,
	               |	РазРяды2.модель.Наименование КАК Наименование,
	               |	РазРяды2.модель.ВыгружатьНаСайтСтильПарк КАК ВыгружатьНаСайтСтильПарк,
	               |	РазРяды2.модель.ВыгружатьВИнтернетМагазин КАК ВыгружатьВИнтернетМагазин
	               |ИЗ
	               |	РазРяды2 КАК РазРяды2
	               |ГДЕ
	               |	РазРяды2.колвоРазРядов > 0";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	// ном	 код	 наименование	ВыгружатьНаб2б	ВыгружатьНаСтильпарк	ВидНом	Бренд	Коллекция
	путьфайла = "";
	Макет = ЭтотОбъект.ПолучитьМакет("МакетРазницаРазмерныхРядов");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьЗаголовок);

	НомПП=1;
	КрОшибки.очистить();
	
	Пока рез.Следующий() цикл
		
		КрОшибки.Добавить(""+Рез.код+" "+рез.наименование+" ВыгружатьНаСайтСтильПарк -"+рез.ВыгружатьНаСайтСтильПарк+", Выгружать б2б " );
		ОбластьСтрока.Параметры.код=Рез.код;
		ОбластьСтрока.Параметры.наименование=рез.наименование;
		ОбластьСтрока.Параметры.ВыгружатьНаб2б=рез.ВыгружатьВИнтернетМагазин;
		ОбластьСтрока.Параметры.ВыгружатьНаСтильпарк=рез.ВыгружатьНаСайтСтильПарк;
		
		
		ОбластьСтрока.Параметры.Ном=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
		//таб
			
				
	конецЦикла;	

	ТабДок.ОтображатьСетку=Ложь;
	
	Имя = Константы.КаталогЕКОД.Получить() + "Заполнение размерных рядов и размеров номенклатуры.xls";     //++++
	
	Попытка
		ТабДок.Записать(Имя,"xls");
	Исключение
		СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	// нечаева 04,12,19---
		
	// Шворобей ВЮ 10.04.2024 ++
	Если крОшибки.Количество() > 0 Тогда
		//	СообщитьКритОшибки(Имя);
		СформироватьВнутреннееУведомление(СписокПолучателей, "Заполнение размерных рядов и размеров номенклатуры", "Заполнение размерных рядов и размеров номенклатуры",
			,, Имя, "helpdesk@collant.ru");
	КонецЕсли;
	// Шворобей ВЮ 10.04.2024 ++

	///////////////////////////////////////////////////////////////////////////////////////////////////
	// Контроль заполнения реквизита "Универсальный Размер" в Размере (УниверсальныйРазмер НЕ ЗАПОЛНЕН)
	///////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Размер КАК Размер,
	|	Номенклатура.Размер.УниверсальныйРазмер КАК УниверсальныйРазмер
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА Номенклатура.Размер.Родитель <> Номенклатура.Родитель.РазмерныйРяд
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ = 1
	|	И (Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ИЛИ Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да))
	|	И Номенклатура.Размер.УниверсальныйРазмер = ЗНАЧЕНИЕ(Справочник.УниверсальныеРазмеры.ПустаяСсылка)";
	
	Рез = Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		
		Выборка = Рез.Выбрать();
		
		Макет = ПолучитьМакет("МакетРазницаРазмерныхРядов");
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Очистить();
		ТабДок.Вывод = ИспользованиеВывода.Разрешить;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка2");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка2");
		
		НомПП = 1;
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			
			ОбластьСтрока.Параметры.Ном = НомПП;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			НомПП = НомПП + 1;
			
		конецЦикла;	
		
		ТабДок.ОтображатьСетку = Ложь;
		
		Имя = Константы.КаталогЕКОД.Получить() + "Универсальный Размер.xls";
		
		Попытка
			ТабДок.Записать(Имя,"xls");
		Исключение
			СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		СформироватьВнутреннееУведомление(СписокПолучателей, "Контроль заполнения реквизита Универсальный Размер", "Контроль заполнения реквизита Универсальный Размер",
			,, Имя, "helpdesk@collant.ru");
		
	Иначе
		СообщитьПользователю("Не найдено незаполненных Размеров");
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Контроль заполнения реквизита "Основной Цвет" в Цвете (ОсновнойЦвет НЕ ЗАПОЛНЕН, галка ОсновнойЦветНеОбязателен НЕ СТОИТ)
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Цвет КАК Цвет,
	|	Номенклатура.Цвет.ОсновнойЦвет КАК ОсновнойЦвет,
	|	Номенклатура.Цвет.ОсновнойЦветНеОбязателен КАК ОсновнойЦветНеОбязателен
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА Номенклатура.Размер.Родитель <> Номенклатура.Родитель.РазмерныйРяд
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ = 1
	|	И (Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ИЛИ Номенклатура.Родитель.ВыгружатьНаСайтСтильПарк = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да))
	|	И Номенклатура.Цвет.ОсновнойЦвет = ЗНАЧЕНИЕ(Справочник.Цвета.ПустаяСсылка)
	|	И НЕ Номенклатура.Цвет.ОсновнойЦветНеОбязателен";
	
	Рез = Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		
		Выборка = Рез.Выбрать();
		
		Макет = ПолучитьМакет("МакетРазницаРазмерныхРядов");
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Очистить();
		ТабДок.Вывод = ИспользованиеВывода.Разрешить;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка3");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка3");
		
		НомПП = 1;
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			
			ОбластьСтрока.Параметры.Ном = НомПП;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			НомПП = НомПП + 1;
			
		конецЦикла;	
		
		ТабДок.ОтображатьСетку = Ложь;
		
		Имя = Константы.КаталогЕКОД.Получить() + "Основной Цвет.xls";
		
		Попытка
			ТабДок.Записать(Имя,"xls");
		Исключение
			СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		СформироватьВнутреннееУведомление(СписокПолучателей, "Контроль заполнения реквизита Основной Цвет", "Контроль заполнения реквизита Основной Цвет",
			,, Имя, "helpdesk@collant.ru");
		
	Иначе
		СообщитьПользователю("Не найдено незаполненных Цветов");
	КонецЕсли;
	
КонецПроцедуры

//-------------------------------------------------------------------------------------
Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	
//	ЗаписатьВЛог("b2b","Начало выполнения. Задача: 1 обмен номенкл, контрагентами. !","Информация");
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("b2b","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	//Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом Тогда        
	//	ЗаписатьВЛог("b2b","Отмена выполнения. Задача: обмен ном, контраг b2b. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	//	Возврат;
	//КонецЕсли;
	//
	//ЗаписатьВЛог("b2b","Начало выполнения. Задача: 2 обмен заказами. !","Информация");                     
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		
		//НаименованиеСправочника = параметры.Получить("НаименованиеСправочника");
		//СписокПолей = параметры.Получить("СписокПолей"); 
				
		ПроверитьДанные(); // 
		
	КонецЕсли;
	
	
	// теперь пропишем у уже загруженных заказов кода
	//ЗаписатьВЛог("b2b","Конец выполнения. Задача: 3 Обмен номенкл, контрагентами. !","Информация");                     
	
	
КонецПроцедуры


крОшибки = новый массив;
крОшибки.Очистить();


// ----------------------------------------------------------------------------------
ТипЦен=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301");

мКаталогВременныхФайлов="С:\1c_obmen\";

тСписокДокументовНаОтправку = Новый ТаблицаЗначений;


Рубли=Константы.НациональнаяВалюта.Получить();
КэшОстатков=Новый Соответствие;	

КритичОшибки= Новый массив;
ПРиКрОш=Ложь;
